<template>
    <div>
        1、双向数据绑定原理不同 vue3可以直接监听数组变化
        2、vue3支持碎片化
        3、API不同 vue2是选项类API

        vue2 中的 object.defineProperty(响应式系统的核心)：初始化的时候，会遍历data中的所有成员，使用defineProperty把对象的属性转换成get和set，如果该成员中的属性还是对象的话，需要递归处理每一个子对象的属性。
        这些都是在初始化的时候进行的。即使你没有使用到这个属性，那么也是会将该属性进行响应式处理。
        vue3 proxy：proxy的性能本身就比defineProperty要好， 另外，代理对象可以拦截属性的访问、赋值、删除等操作，不需要初始化时遍历所有的属性。另外，如果有多层属性嵌套的话，只有访问某个属性的时候，才会递归处理下一级的属性。
        使用proxy默认就可以监听到动态新增的属性，可以监听到删除的属性。可以监听数组的索引和length属性。
    </div>
</template>